# Limpieza a tabla residentes de 2017

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('RESIDENTES_2017.csv', encoding='latin', low_memory=False)
df.head()

,UPM_DIS,VIV_SEL,HOGAR,N_REN,PARENTESCO,SEXO,EDAD,ASISESC,NIVEL,GRADO,DIA,MES,USOCOMPU,USOINTER,USOCEL,CONDACT,VERIACT,POSOCUP,EST_DIS
0,1,1,1,1,1,1,66,2.0,2.0,6.0,NaN,NaN,2.0,2.0,2.0,1.0,NaN,3.0,3
1,1,1,1,2,2,2,62,2.0,2.0,6.0,NaN,NaN,2.0,2.0,2.0,6.0,4.0,NaN,3
2,1,1,1,3,3,1,42,2.0,3.0,3.0,NaN,NaN,1.0,1.0,1.0,1.0,NaN,1.0,3
3,1,1,1,4,3,1,34,2.0,7.0,3.0,NaN,NaN,1.0,1.0,1.0,1.0,NaN,1.0,3
4,1,2,1,1,1,1,39,2.0,8.0,3.0,NaN,NaN,2.0,2.0,1.0,1.0,NaN,3.0,3

## filas

In [3]:
df.shape[0]

481572

## columnas

In [4]:
df.shape[1]

19

# UPM_DIS Unidad primaria de muestreo

In [5]:
df.UPM_DIS.value_counts()

1291     157
1249     154
1238     138
399      137
6738     134
11814    133
1287     133
1239     131
4061     122
14070    120
4119     118
1288     116
471      114
4106     113
4116     113
15258    112
8690     110
4099     108
4135     108
18013    107
17997    107
4117     107
6854     107
6843     106
10247    106
19375    105
7993     105
451      104
15257    104
4113     103
        ...
10663      2
16191      2
18052      2
17265      2
16337      2
14321      2
5472       2
13602      2
14724      2
13393      2
18792      2
17850      2
8029       2
18520      2
13729      2
7833       2
13601      2
16139      2
3768       2
14001      1
12563      1
18527      1
5277       1
883        1
13948      1
18491      1
14132      1
13984      1
9595       1
6944       1
Name: UPM_DIS, Length: 19903, dtype: int64

In [6]:
df.isnull().UPM_DIS.any()

False

In [7]:
df.UPM_DIS.value_counts().sum()

481572

# VIV_SEL Vivienda seleccionada

In [8]:
df.VIV_SEL.value_counts()

2     62386
1     62278
3     61927
4     61858
5     61524
7     18742
9     18741
8     18600
6     18576
10    18534
11     7929
15     7801
18     7763
14     7762
16     7759
19     7707
13     7675
12     7633
17     7582
20     7032
21      825
22      246
31       51
30       47
28       46
34       46
25       44
40       43
27       41
26       40
32       39
37       39
33       36
29       33
24       33
35       33
38       33
23       31
36       29
39       28
Name: VIV_SEL, dtype: int64

In [11]:
np.unique(df.VIV_SEL)

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16, 17,
       18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34,
       35, 36, 37, 38, 39, 40])

In [12]:
df.isnull().VIV_SEL.any()

False

In [13]:
df.VIV_SEL.value_counts().sum()

481572

In [14]:
df.head()

,UPM_DIS,VIV_SEL,HOGAR,N_REN,PARENTESCO,SEXO,EDAD,ASISESC,NIVEL,GRADO,DIA,MES,USOCOMPU,USOINTER,USOCEL,CONDACT,VERIACT,POSOCUP,EST_DIS
0,1,1,1,1,1,1,66,2.0,2.0,6.0,NaN,NaN,2.0,2.0,2.0,1.0,NaN,3.0,3
1,1,1,1,2,2,2,62,2.0,2.0,6.0,NaN,NaN,2.0,2.0,2.0,6.0,4.0,NaN,3
2,1,1,1,3,3,1,42,2.0,3.0,3.0,NaN,NaN,1.0,1.0,1.0,1.0,NaN,1.0,3
3,1,1,1,4,3,1,34,2.0,7.0,3.0,NaN,NaN,1.0,1.0,1.0,1.0,NaN,1.0,3
4,1,2,1,1,1,1,39,2.0,8.0,3.0,NaN,NaN,2.0,2.0,1.0,1.0,NaN,3.0,3

# HOGAR
## [1-6]

In [15]:
df.HOGAR.value_counts()

1    472835
2      7544
3       994
4       168
5        31
Name: HOGAR, dtype: int64

In [16]:
df.isnull().HOGAR.any()

False

In [17]:
df.HOGAR.value_counts().sum()

481572

# N_REN
## [01-30]

In [18]:
df.N_REN.value_counts()

1     134358
2     118530
3      94046
4      67184
5      36477
6      16479
7       7538
8       3548
9       1675
10       886
11       380
12       215
13       110
14        59
15        37
16        24
17        10
18         4
29         1
19         1
20         1
21         1
22         1
23         1
24         1
25         1
26         1
27         1
28         1
30         1
Name: N_REN, dtype: int64

In [19]:
df.isnull().N_REN.any()

False

In [20]:
df.N_REN.value_counts().sum()

481572

# PARENTESCO
### 1 Jefe(a)
### 2 Esposo(a) o compañero(a)
### 3 Hijo(a)
### 4 Nieto(a)
### 5 Otro parentesco
### 6 Sin parentesco

In [21]:
df.PARENTESCO.value_counts()

3    191069
1    134795
2     88032
4     32404
5     30505
6      4767
Name: PARENTESCO, dtype: int64

In [22]:
df.isnull().PARENTESCO.any()

False

In [23]:
df.PARENTESCO.value_counts().sum()

481572

# SEXO
### 1 Hombre, 2 Mujer

In [24]:
df.SEXO.value_counts()

2    247647
1    233925
Name: SEXO, dtype: int64

In [25]:
df.isnull().SEXO.any()

False

In [26]:
df.SEXO.value_counts().sum()

481572

In [27]:
df.head(2)

,UPM_DIS,VIV_SEL,HOGAR,N_REN,PARENTESCO,SEXO,EDAD,ASISESC,NIVEL,GRADO,DIA,MES,USOCOMPU,USOINTER,USOCEL,CONDACT,VERIACT,POSOCUP,EST_DIS
0,1,1,1,1,1,1,66,2.0,2.0,6.0,NaN,NaN,2.0,2.0,2.0,1.0,NaN,3.0,3
1,1,1,1,2,2,2,62,2.0,2.0,6.0,NaN,NaN,2.0,2.0,2.0,6.0,4.0,NaN,3

# EDAD
### 0 Menos de un año
### 1-96 Años cumplidos 
### 97  97 o más años
### 99 No sabe

In [28]:
df.EDAD.value_counts()

17    9540
18    9199
15    9170
12    9135
16    9068
8     8872
14    8784
22    8781
13    8716
10    8712
20    8692
9     8512
40    8500
23    8400
5     8385
7     8380
11    8350
25    8241
4     8216
24    8189
6     8153
30    8108
19    7990
21    7940
3     7875
42    7740
2     7564
28    7492
32    7416
38    7395
      ...
66    2624
68    2363
72    2031
69    1876
73    1815
74    1696
75    1666
71    1434
76    1428
77    1245
78    1244
80    1205
79     875
82     835
83     733
84     688
81     648
85     600
86     527
87     479
88     335
90     300
89     298
97     187
92     153
91     146
93     132
94     124
95      89
96      86
Name: EDAD, Length: 98, dtype: int64

In [29]:
pd.unique(df.EDAD)

array([66, 62, 42, 34, 39, 28,  2,  4, 75, 72, 21, 22, 24, 20, 86, 81, 41,
       45, 43, 23, 50, 69, 67, 37, 31, 54, 58, 26, 78, 76, 52, 40, 49, 14,
       44, 18, 27, 53, 17, 15, 13, 46, 48, 19, 11, 33,  9,  8,  1, 38, 16,
       70, 87, 10,  5, 84, 47,  6, 73, 30, 55, 85, 36, 35, 56, 61, 60, 74,
       68, 29, 57, 65,  3,  7, 25, 64, 32, 80, 51, 92, 59, 71, 91, 88, 63,
       93, 83, 79, 82, 12,  0, 77, 89, 95, 97, 90, 96, 94])

In [30]:
df.isnull().EDAD.any()

False

In [31]:
df.EDAD.value_counts().sum()

481572

# ASISESC asiste actualmente a la escuela?
### 1 Si, 2 No, 99 blanco

In [32]:
df.ASISESC.value_counts()

2.0    311253
1.0    125139
Name: ASISESC, dtype: int64

In [33]:
df.isnull().ASISESC.any()

True

### remplazamos valores nulos por 99

In [34]:
df.ASISESC = df.ASISESC.astype('str')
df.ASISESC.replace({'nan':'99'}, inplace=True)

### cambiamos el tipo de dato a int

In [35]:
df.ASISESC = df.ASISESC.astype('float').astype('int64')

In [36]:
df.ASISESC.value_counts()

2     311253
1     125139
99     45180
Name: ASISESC, dtype: int64

In [37]:
df.ASISESC.value_counts().sum()

481572

In [38]:
df.head(3)

,UPM_DIS,VIV_SEL,HOGAR,N_REN,PARENTESCO,SEXO,EDAD,ASISESC,NIVEL,GRADO,DIA,MES,USOCOMPU,USOINTER,USOCEL,CONDACT,VERIACT,POSOCUP,EST_DIS
0,1,1,1,1,1,1,66,2,2.0,6.0,NaN,NaN,2.0,2.0,2.0,1.0,NaN,3.0,3
1,1,1,1,2,2,2,62,2,2.0,6.0,NaN,NaN,2.0,2.0,2.0,6.0,4.0,NaN,3
2,1,1,1,3,3,1,42,2,3.0,3.0,NaN,NaN,1.0,1.0,1.0,1.0,NaN,1.0,3

# NIVEL  ¿Hasta qué año o grado aprobó en la escuela? 
#### 0 Ninguno
#### 1 Preescolar o kínder
#### 2 Primaria
#### 3 Secundaria
#### 4 Preparatoria o bachillerato
#### 5 Normal básica
#### 6 Maestría y doctorado
#### 7 Otro (Licenciatura ,ingeniería  Especialidad, studio técnico terminal con secundaria)
#### 99 blanco

In [39]:
df.NIVEL.value_counts()

2.0     132196
3.0     115298
6.0      71808
8.0      64995
0.0      16535
1.0      10704
7.0       8690
5.0       7047
10.0      4312
99.0      1586
9.0       1424
4.0       1019
11.0       778
Name: NIVEL, dtype: int64

In [40]:
df.isnull().NIVEL.any()

True

In [41]:
df.NIVEL = df.NIVEL.astype('str')
df.NIVEL.replace({'nan':'99'}, inplace=True)

In [42]:
df.NIVEL = df.NIVEL.astype('float').astype('int64')

In [43]:
df.NIVEL.value_counts()

2     132196
3     115298
6      71808
8      64995
99     46766
0      16535
1      10704
7       8690
5       7047
10      4312
9       1424
4       1019
11       778
Name: NIVEL, dtype: int64

#### 5 --> 7 Otros( Estudio técnico terminal con secundaria)
#### 4 --> 5 Normal básica
#### 6 -->  4 Preparatoria o bachillerato
#### 8 --> 7 Otros (Licenciatura oingeniería)
#### 9 --> 7 Otros (Especialidad)
#### 10 --> 6 Maestría y Doctorado
#### 11 --> 6 Maestría y Doctorado

In [45]:
df.NIVEL = df.NIVEL.astype('str')
df.NIVEL.replace({'5':'7'}, inplace=True)

In [47]:
df.NIVEL.replace({'4':'5'}, inplace=True)

In [49]:
df.NIVEL.replace({'6':'4'}, inplace=True)

In [53]:
df.NIVEL.replace({'8':'7'}, inplace=True)
df.NIVEL.replace({'9':'7'}, inplace=True)

In [57]:
df.NIVEL.replace({'10':'6'}, inplace=True)
df.NIVEL.replace({'11':'6'}, inplace=True)

In [59]:
df.NIVEL = df.NIVEL.astype('float').astype('int64')

In [60]:
df.NIVEL.value_counts()

2     132196
3     115298
7      82156
4      71808
99     46766
0      16535
1      10704
6       5090
5       1019
Name: NIVEL, dtype: int64

In [61]:
#df.to_csv('residentas_half_clean.csv')
df.NIVEL.value_counts().sum()

481572

In [63]:
df.head(4)

,UPM_DIS,VIV_SEL,HOGAR,N_REN,PARENTESCO,SEXO,EDAD,ASISESC,NIVEL,GRADO,DIA,MES,USOCOMPU,USOINTER,USOCEL,CONDACT,VERIACT,POSOCUP,EST_DIS
0,1,1,1,1,1,1,66,2,2,6.0,NaN,NaN,2.0,2.0,2.0,1.0,NaN,3.0,3
1,1,1,1,2,2,2,62,2,2,6.0,NaN,NaN,2.0,2.0,2.0,6.0,4.0,NaN,3
2,1,1,1,3,3,1,42,2,3,3.0,NaN,NaN,1.0,1.0,1.0,1.0,NaN,1.0,3
3,1,1,1,4,3,1,34,2,7,3.0,NaN,NaN,1.0,1.0,1.0,1.0,NaN,1.0,3

# GRADO 
### 0-8 Grado cursando o aprobado 
### 99 No sabe / blanco

In [64]:
df.GRADO.value_counts()

3.0    182027
2.0     58892
6.0     56340
1.0     44106
5.0     38266
4.0     36919
0.0     16535
9.0      3307
Name: GRADO, dtype: int64

In [65]:
df.isnull().GRADO.any()

True

In [66]:
df.GRADO = df.GRADO.astype('str')
df.GRADO.replace({'nan':'99'}, inplace=True)

In [67]:
df.GRADO.value_counts()

3.0    182027
2.0     58892
6.0     56340
99      45180
1.0     44106
5.0     38266
4.0     36919
0.0     16535
9.0      3307
Name: GRADO, dtype: int64

In [68]:
df.isnull().GRADO.any()

False

In [69]:
df.GRADO = df.GRADO.astype('float').astype('int64')

In [70]:
df.GRADO.value_counts()

3     182027
2      58892
6      56340
99     45180
1      44106
5      38266
4      36919
0      16535
9       3307
Name: GRADO, dtype: int64

In [71]:
df.GRADO = df.GRADO.astype('str')
df.GRADO.replace({'9':'99'}, inplace=True)
df.GRADO = df.GRADO.astype('float').astype('int64')

In [72]:
df.GRADO.value_counts()

3     182027
2      58892
6      56340
99     48487
1      44106
5      38266
4      36919
0      16535
Name: GRADO, dtype: int64

In [73]:
df.GRADO.value_counts().sum()

481572

# DIA ¿En qué día nació?
### 1-31 Día de nacimiento
### 99 No sabe / blanco

In [74]:
df.DIA.value_counts()

15.0    345
1.0     220
10.0    216
3.0     209
8.0     205
20.0    202
18.0    201
26.0    197
17.0    193
24.0    193
6.0     192
4.0     191
5.0     191
7.0     191
21.0    190
19.0    190
23.0    188
11.0    186
22.0    185
14.0    183
12.0    183
2.0     180
13.0    177
25.0    171
28.0    170
27.0    170
16.0    162
30.0    158
9.0     157
29.0    150
99.0    137
31.0     84
Name: DIA, dtype: int64

In [75]:
df.isnull().DIA.any()

True

In [76]:
df.DIA = df.DIA.astype('str')
df.DIA.replace({'nan':'99'}, inplace=True)
df.DIA = df.DIA.astype('float').astype('int64')

In [77]:
df.isnull().DIA.any()

False

In [78]:
df.DIA.value_counts()

99    475742
15       345
1        220
10       216
3        209
8        205
20       202
18       201
26       197
17       193
24       193
6        192
7        191
4        191
5        191
19       190
21       190
23       188
11       186
22       185
14       183
12       183
2        180
13       177
25       171
28       170
27       170
16       162
30       158
9        157
29       150
31        84
Name: DIA, dtype: int64

### más del 90 por cierto es nulo

In [79]:
df.drop('DIA',1, inplace=True)

# Mes

### más del 90 % es nulo

In [80]:
df.MES.value_counts().sum()

5967

In [81]:
df.drop('MES',1, inplace=True)

In [82]:
df.head(2)

,UPM_DIS,VIV_SEL,HOGAR,N_REN,PARENTESCO,SEXO,EDAD,ASISESC,NIVEL,GRADO,USOCOMPU,USOINTER,USOCEL,CONDACT,VERIACT,POSOCUP,EST_DIS
0,1,1,1,1,1,1,66,2,2,6,2.0,2.0,2.0,1.0,NaN,3.0,3
1,1,1,1,2,2,2,62,2,2,6,2.0,2.0,2.0,6.0,4.0,NaN,3

# USOCOMPU  ¿En los últimos tres meses, ¿ha hecho uso de… Computadora, laptop o tablet?
### 1 Sí
### 2 No
### 9 No sabe / blanco

In [83]:
df.USOCOMPU.value_counts()

2.0    234313
1.0    201032
9.0      1047
Name: USOCOMPU, dtype: int64

In [84]:
df.isnull().USOCOMPU.any()

True

In [89]:
df.USOCOMPU = df.USOCOMPU.astype('str')
df.USOCOMPU.replace({'nan':'99','9':'99'}, inplace=True)
df.USOCOMPU = df.USOCOMPU.astype('float').astype('int64')

In [86]:
df.isnull().USOCOMPU.any()

False

In [90]:
df.USOCOMPU.value_counts()

2     234313
1     201032
99     46227
Name: USOCOMPU, dtype: int64

In [91]:
df.USOCOMPU.value_counts().sum()

481572

# USOINTER  ¿En los últimos tres meses, ¿ha hecho uso de… internet?
### 1 Sí
### 2 No
### 9 No sabe / blanco

In [92]:
df.USOINTER.value_counts()

1.0    273133
2.0    162313
9.0       946
Name: USOINTER, dtype: int64

In [93]:
df.isnull().USOINTER.any()

True

In [99]:
df.USOINTER = df.USOINTER.astype('str')
df.USOINTER.replace({'nan':'99', '9':'99'}, inplace=True)
df.USOINTER = df.USOINTER.astype('float').astype('int64')

In [100]:
df.isnull().USOINTER.any()

False

In [101]:
df.USOINTER.value_counts()

1     273133
2     162313
99     46126
Name: USOINTER, dtype: int64

In [102]:
df.USOINTER.value_counts().sum()

481572

# USOCEL  ¿En los últimos tres meses, ¿ha hecho uso de… Celular?
### 1 Sí
### 2 No
### 9 No sabe / blanco

In [103]:
df.USOCEL.value_counts()

1.0    332291
2.0    103934
9.0       167
Name: USOCEL, dtype: int64

In [104]:
df.isnull().USOCEL.any()

True

In [108]:
df.USOCEL = df.USOCEL.astype('str')
df.USOCEL.replace({'nan':'99', '9':'99'}, inplace=True)
df.USOCEL = df.USOCEL.astype('float').astype('int64')

In [106]:
df.isnull().USOCEL.any()

False

In [109]:
df.USOCEL.value_counts()

1     332291
2     103934
99     45347
Name: USOCEL, dtype: int64

In [110]:
df.USOCEL.value_counts().sum()

481572

In [111]:
df.head(2)

,UPM_DIS,VIV_SEL,HOGAR,N_REN,PARENTESCO,SEXO,EDAD,ASISESC,NIVEL,GRADO,USOCOMPU,USOINTER,USOCEL,CONDACT,VERIACT,POSOCUP,EST_DIS
0,1,1,1,1,1,1,66,2,2,6,2,2,2,1.0,NaN,3.0,3
1,1,1,1,2,2,2,62,2,2,6,2,2,2,6.0,4.0,NaN,3

# CONDACT ¿La semana pasada
#### 1 trabajó (por lo menos una hora)?
#### 2 tenía trabajo, pero no trabajó?
#### 3 buscó trabajo?
#### 4 está jubilado(a) o pensionado(a)?
#### 5 se dedicó a estudiar?
#### 6 se dedicó a los quehaceres del hogar y/o al cuidado de sus hijos(as) u otro familiar?
#### 7 es una persona con alguna limitación física o mental que le impide trabajar?
#### 8 no trabajó?
#### b --> 99 blanco

In [112]:
df.CONDACT.value_counts()

1.0    209200
6.0     76165
5.0     60481
4.0     13827
8.0     12306
3.0      5631
7.0      5009
2.0      2794
Name: CONDACT, dtype: int64

In [113]:
df.isnull().CONDACT.any()

True

In [114]:
df.CONDACT = df.CONDACT.astype('str')
df.CONDACT.replace({'nan':'99'}, inplace=True)
df.CONDACT = df.CONDACT.astype('float').astype('int64')

In [115]:
df.isnull().CONDACT.any()

False

In [116]:
df.CONDACT.value_counts()

1     209200
99     96159
6      76165
5      60481
4      13827
8      12306
3       5631
7       5009
2       2794
Name: CONDACT, dtype: int64

In [117]:
df.CONDACT.value_counts().sum()

481572

# VERIACT Aunque ya me dijo queno trabajó, ¿la semana pasada…
#### 1 vendió o hizo algún producto para su venta?
#### 2 prestó algún servicio a cambio de un pago (cortar cabello, dar clases, lavar ropa ajena)?
#### 3 ayudó en las tierras o en el negocio de un familiar o de otra persona?
#### 4 Entonces, ¿no trabajó?
#### b --> 99 blanco

In [118]:
df.VERIACT.value_counts()

4.0    154207
1.0      6250
3.0      5314
2.0      2639
Name: VERIACT, dtype: int64

In [119]:
df.isnull().VERIACT.any()

True

In [120]:
df.VERIACT = df.VERIACT.astype('str')
df.VERIACT.replace({'nan':'99'}, inplace=True)
df.VERIACT = df.VERIACT.astype('float').astype('int64')

In [121]:
df.isnull().VERIACT.any()

False

In [122]:
df.VERIACT.value_counts()

99    313162
4     154207
1       6250
3       5314
2       2639
Name: VERIACT, dtype: int64

In [123]:
df.VERIACT.value_counts().sum()

481572

In [124]:
df.head(2)

,UPM_DIS,VIV_SEL,HOGAR,N_REN,PARENTESCO,SEXO,EDAD,ASISESC,NIVEL,GRADO,USOCOMPU,USOINTER,USOCEL,CONDACT,VERIACT,POSOCUP,EST_DIS
0,1,1,1,1,1,1,66,2,2,6,2,2,2,1,99,3.0,3
1,1,1,1,2,2,2,62,2,2,6,2,2,2,6,4,NaN,3

# POSOCUP ¿En su trabajo o actividad de la semana pasada fue…
#### 1 empleado(a) u obrero(a)?
#### 2 jornalero(a) o peón?
#### 3 trabajador(a) por cuenta propia (no contrata trabajadores(as))?
#### 4 patrón(a) o empleador(a) (contrata trabajadores(as))?
#### 5 trabajador(a) sin pago en un negocio familiar o no familiar?
#### 99 blanco

In [125]:
df.POSOCUP.value_counts()

1.0    150182
3.0     51571
2.0     12817
5.0      7637
4.0      3990
Name: POSOCUP, dtype: int64

In [126]:
df.isnull().POSOCUP.any()

True

In [127]:
df.POSOCUP = df.POSOCUP.astype('str')
df.POSOCUP.replace({'nan':'99'}, inplace=True)
df.POSOCUP = df.POSOCUP.astype('float').astype('int64')

In [128]:
df.isnull().POSOCUP.any()

False

In [129]:
df.POSOCUP.value_counts()

99    255375
1     150182
3      51571
2      12817
5       7637
4       3990
Name: POSOCUP, dtype: int64

In [130]:
df.POSOCUP.value_counts().sum()

481572

# EST_DIS Estrato de diseño muestral

In [131]:
df.EST_DIS.value_counts()

366    5704
274    4658
225    4637
169    4343
109    4106
145    3965
193    3905
491    3862
495    3835
121    3828
320    3813
144    3807
189    3769
49     3752
123    3695
12     3655
102    3525
61     3455
205    3444
487    3433
244    3425
395    3403
163    3293
541    3239
578    3223
128    3186
521    3172
467    3129
353    3111
375    3063
       ...
76       46
548      44
456      44
230      44
425      44
539      44
166      44
53       41
405      40
231      40
411      40
18       38
551      34
294      34
398      34
365      33
216      32
325      32
567      31
198      31
273      31
143      31
538      30
179      29
178      29
132      28
403      26
297      26
402      20
81       18
Name: EST_DIS, Length: 587, dtype: int64

In [132]:
df.isnull().EST_DIS.any()

False

In [133]:
df.EST_DIS.value_counts().sum()

481572

## todas las columnas ya estan limpias

In [134]:
df.head(1)

,UPM_DIS,VIV_SEL,HOGAR,N_REN,PARENTESCO,SEXO,EDAD,ASISESC,NIVEL,GRADO,USOCOMPU,USOINTER,USOCEL,CONDACT,VERIACT,POSOCUP,EST_DIS
0,1,1,1,1,1,1,66,2,2,6,2,2,2,1,99,3,3

In [136]:
df.dtypes

UPM_DIS       int64
VIV_SEL       int64
HOGAR         int64
N_REN         int64
PARENTESCO    int64
SEXO          int64
EDAD          int64
ASISESC       int64
NIVEL         int64
GRADO         int64
USOCOMPU      int64
USOINTER      int64
USOCEL        int64
CONDACT       int64
VERIACT       int64
POSOCUP       int64
EST_DIS       int64
dtype: object

In [ ]:
df.to_csv('residentes_2017_clean.csv')